#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/Tyk/repo-policy-tyk/runs/run-hRf8VyCeMLxuxT4M

Waiting for the plan to start...

Terraform v1.5.2
on linux_amd64
Initializing plugins and modules...
module.tyk.github_repository.repository: Refreshing state... [id=tyk]
module.tyk.github_branch.default: Refreshing state... [id=tyk:master]
module.tyk.github_branch.release_branches["release-5.0.1"]: Refreshing state... [id=tyk:release-5.0.1]
module.tyk.github_branch.release_branches["release-4.0.13"]: Refreshing state... [id=tyk:release-4.0.13]
module.tyk.github_branch.release_branches["release-4.0.14"]: Refreshing state... [id=tyk:release-4.0.14]
module.tyk.github_branch.release_branches["release-5.1.1"]: Refreshing state... [id=tyk:release-5.1.1]
module.tyk.github_branch.release_branches["release-4.3.3"]: Refreshing state... [id=tyk:release-4.3.3]
module.tyk.github_branch.release_branches["release-5.0"]: Refreshing state... [id=tyk:release-5.0]
module.tyk.github_branch.release_branches["release-5.0.2"]: Refreshing state... [id=tyk:release-5.0.2]
module.tyk.github_branch.release_branches["release-4.3"]: Refreshing state... [id=tyk:release-4.3]
module.tyk.github_branch.release_branches["release-5.0.3"]: Refreshing state... [id=tyk:release-5.0.3]
module.tyk.github_branch.release_branches["release-4.3.1"]: Refreshing state... [id=tyk:release-4.3.1]
module.tyk.github_branch.release_branches["release-5.1"]: Refreshing state... [id=tyk:release-5.1]
module.tyk.github_branch.release_branches["release-5.0.4"]: Refreshing state... [id=tyk:release-5.0.4]
module.tyk.github_branch.release_branches["release-4.0.11"]: Refreshing state... [id=tyk:release-4.0.11]
module.tyk.github_branch.release_branches["release-4.0.10"]: Refreshing state... [id=tyk:release-4.0.10]
module.tyk.github_branch.release_branches["release-4.3.0"]: Refreshing state... [id=tyk:release-4.3.0]
module.tyk.github_branch.release_branches["release-5.1.0"]: Refreshing state... [id=tyk:release-5.1.0]
module.tyk.github_branch.release_branches["release-4-lts"]: Refreshing state... [id=tyk:release-4-lts]
module.tyk.github_branch.release_branches["release-4.3.2"]: Refreshing state... [id=tyk:release-4.3.2]
module.tyk.github_branch.release_branches["release-4.0.12"]: Refreshing state... [id=tyk:release-4.0.12]
module.tyk.github_branch.release_branches["master"]: Refreshing state... [id=tyk:master]
module.tyk.github_branch.release_branches["release-5-lts"]: Refreshing state... [id=tyk:release-5-lts]
module.tyk.github_branch_protection.automerge["release-5.1.0"]: Refreshing state... [id=BPR_kwDOASogO84CQ5Pi]
module.tyk.github_branch_protection.automerge["master"]: Refreshing state... [id=MDIwOkJyYW5jaFByb3RlY3Rpb25SdWxlNTQ5MzczOA==]
module.tyk.github_branch_protection.automerge["release-4.0.12"]: Refreshing state... [id=BPR_kwDOASogO84CBpF8]
module.tyk.github_branch_protection.automerge["release-5.0.1"]: Refreshing state... [id=BPR_kwDOASogO84CKAgU]
module.tyk.github_branch_protection.automerge["release-4.0.10"]: Refreshing state... [id=BPR_kwDOASogO84B4l7t]
module.tyk.github_branch_protection.automerge["release-4.3.0"]: Refreshing state... [id=BPR_kwDOASogO84B0oVa]
module.tyk.github_branch_protection.automerge["release-5.0.2"]: Refreshing state... [id=BPR_kwDOASogO84CM6pt]
module.tyk.github_branch_protection.automerge["release-5.0.4"]: Refreshing state... [id=BPR_kwDOASogO84CWOCD]
module.tyk.github_branch_protection.automerge["release-4.0.13"]: Refreshing state... [id=BPR_kwDOASogO84CKAgK]
module.tyk.github_branch_protection.automerge["release-4-lts"]: Refreshing state... [id=BPR_kwDOASogO84CPEU0]
module.tyk.github_branch_protection.automerge["release-4.3.1"]: Refreshing state... [id=BPR_kwDOASogO84B4l7u]
module.tyk.github_branch_protection.automerge["release-5.0"]: Refreshing state... [id=BPR_kwDOASogO84CEkCR]
module.tyk.github_branch_protection.automerge["release-4.0.11"]: Refreshing state... [id=BPR_kwDOASogO84B-HpU]
module.tyk.github_branch_protection.automerge["release-4.3.3"]: Refreshing state... [id=BPR_kwDOASogO84CBpF-]
module.tyk.github_branch_protection.automerge["release-5.1.1"]: Refreshing state... [id=BPR_kwDOASogO84CWOCE]
module.tyk.github_branch_protection.automerge["release-4.3"]: Refreshing state... [id=BPR_kwDOASogO84B0oVb]
module.tyk.github_branch_protection.automerge["release-5-lts"]: Refreshing state... [id=BPR_kwDOASogO84CEReR]
module.tyk.github_branch_protection.automerge["release-4.3.2"]: Refreshing state... [id=BPR_kwDOASogO84B-HpS]
module.tyk.github_branch_protection.automerge["release-4.0.14"]: Refreshing state... [id=BPR_kwDOASogO84CRdtp]
module.tyk.github_branch_protection.automerge["release-5.0.3"]: Refreshing state... [id=BPR_kwDOASogO84CRdto]
module.tyk.github_branch_protection.automerge["release-5.1"]: Refreshing state... [id=BPR_kwDOASogO84CQD6D]
module.tyk.github_branch_default.default: Refreshing state... [id=tyk]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.tyk.github_branch.release_branches["release-5.0.5"] will be created
  + resource "github_branch" "release_branches" {
      + branch        = "release-5.0.5"
      + etag          = (known after apply)
      + id            = (known after apply)
      + ref           = (known after apply)
      + repository    = "tyk"
      + sha           = (known after apply)
      + source_branch = "release-5-lts"
      + source_sha    = (known after apply)
    }

  # module.tyk.github_branch.release_branches["release-5.1.2"] will be created
  + resource "github_branch" "release_branches" {
      + branch        = "release-5.1.2"
      + etag          = (known after apply)
      + id            = (known after apply)
      + ref           = (known after apply)
      + repository    = "tyk"
      + sha           = (known after apply)
      + source_branch = "release-5.1"
      + source_sha    = (known after apply)
    }

  # module.tyk.github_branch_protection.automerge["release-5.0.1"] will be updated in-place
  ~ resource "github_branch_protection" "automerge" {
      ~ force_push_bypassers            = [
          - "/buger",
        ]
        id                              = "BPR_kwDOASogO84CKAgU"
        # (11 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.tyk.github_branch_protection.automerge["release-5.0.5"] will be created
  + resource "github_branch_protection" "automerge" {
      + allows_deletions                = false
      + allows_force_pushes             = false
      + blocks_creations                = false
      + enforce_admins                  = false
      + id                              = (known after apply)
      + lock_branch                     = false
      + pattern                         = "release-5.0.5"
      + repository_id                   = "MDEwOlJlcG9zaXRvcnkxOTUzNzk3OQ=="
      + require_conversation_resolution = false
      + require_signed_commits          = false
      + required_linear_history         = false

      + required_pull_request_reviews {
          + require_code_owner_reviews      = false
          + require_last_push_approval      = false
          + required_approving_review_count = 0
        }

      + required_status_checks {
          + contexts = [
              + "1.16",
              + "1.16-el7",
              + "Go 1.16 Redis 5",
            ]
          + strict   = true
        }
    }

  # module.tyk.github_branch_protection.automerge["release-5.1.2"] will be created
  + resource "github_branch_protection" "automerge" {
      + allows_deletions                = false
      + allows_force_pushes             = false
      + blocks_creations                = false
      + enforce_admins                  = false
      + id                              = (known after apply)
      + lock_branch                     = false
      + pattern                         = "release-5.1.2"
      + repository_id                   = "MDEwOlJlcG9zaXRvcnkxOTUzNzk3OQ=="
      + require_conversation_resolution = false
      + require_signed_commits          = false
      + required_linear_history         = false

      + required_pull_request_reviews {
          + require_code_owner_reviews      = false
          + require_last_push_approval      = false
          + required_approving_review_count = 0
        }

      + required_status_checks {
          + contexts = [
              + "1.19-bullseye",
              + "Go 1.19.x Redis 5",
            ]
          + strict   = true
        }
    }

Plan: 4 to add, 1 to change, 0 to destroy.


```

</details>

*Pushed by: @lghiur, Action: `pull_request`*